# taps
tap "hedge-ops/homebrew-tap"
tap "minorole/tap"
tap "nikitabobko/tap"
tap "aquaproj/aqua"
tap "steveyegge/beads"
tap "vicentereig/tap"

# terminal
brew "bat" # better cat with syntax highlighting
brew "btop" # process/system monitor
brew "cloc" # count lines of code
brew "direnv" # per-directory env vars
brew "eza" # modern ls replacement
brew "fd" # better find
brew "fswatch" # file watcher
brew "fzf" # fuzzy finder
brew "hyperfine" # CLI benchmarking tool
brew "jq" # json processor
brew "ripgrep" # better grep
brew "starship" # better prompt
brew "tldr" # simplified man pages with examples
brew "pandoc" # document converter (markdown to pdf, etc)
cask "basictex" # minimal latex for pandoc pdf output
brew "tree" # directory tree
brew "wget" # download files
brew "zoxide" # better cd
cask "ghostty" # terminal emulator

# git
brew "gh" # github cli
brew "git"
brew "git-delta" # syntax-highlighted diffs
brew "git-filter-repo" # rewrite git history
brew "lazygit" # git tui
cask "github" # github desktop

# editor
brew "lua-language-server" # lsp for lua/neovim configs
brew "luarocks" # lua packages for neovim plugins
brew "neovim"
brew "tree-sitter" # syntax parsing for neovim
brew "tree-sitter-cli"

# yazi (file manager + preview deps)
brew "ffmpeg" # video preview
brew "imagemagick" # image preview
brew "poppler" # pdf preview
brew "sevenzip" # archive preview
brew "yazi" # terminal file manager

# fonts (nerd fonts include icons for terminal)
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# rust
brew "bacon" # background rust checker
# brew "bacon-ls" # not ready yet
brew "cargo-binstall" # binary installer
brew "just" # make alternative
brew "rustup" # rust toolchain

# swift
brew "fastlane" # ios automation
brew "swiftformat"
brew "swiftlint"
brew "xcode-build-server" # lsp for xcode projects
brew "xcodegen" # generate xcodeproj from yaml
cask "sf-symbols" # browse apple sf symbols

# web
brew "dprint" # fast code formatter
brew "eslint"
brew "node@24"
brew "pnpm"

# python
brew "uv" # manages python, packages, and virtual environments

# ruby (for fastlane)
brew "rbenv"

# java
brew "openjdk"

# c#/.net
cask "dotnet-sdk"

# cloud
brew "aquaproj/aqua/aqua" # per-project CLI tool manager
brew "derailed/k9s/k9s" # kubernetes tui
brew "doctl" # digitalocean cli
brew "kubernetes-cli"
cask "docker-desktop"

# database
brew "sqlx-cli" # rust sql migrations/checks
cask "pgadmin4"

# api
brew "stripe-cli"
cask "ngrok" # expose localhost publicly
cask "postman"

# ai
brew "gemini-cli"
brew "steveyegge/beads/bd" # ai task automation
cask "claude"
cask "superwhisper" # voice dictation for ai prompts

# editors
cask "antigravity" # google's ai code editor
cask "visual-studio-code"
cask "zed"

# macos
cask "aerospace" # window manager

# collaboration
cask "discord"
cask "google-chrome"
cask "slack"

# utilities
cask "anki" # flashcards
cask "balenaetcher" # usb flashing

# analytics
brew "vicentereig/tap/plausible" # privacy-friendly analytics cli

# people
cask "people-work"
