# development CLI tools are managed by aqua per project.
# this handles everything else.

# taps
tap "hedge-ops/homebrew-tap"
tap "minorole/tap"
tap "anomalyco/tap"
tap "nikitabobko/tap"

# people work dependencies
brew "aqua" # per-project CLI tool manager
brew "just" # task runner
brew "colima" # container runtime for tests and local db
brew "docker" # CLI only, desktop replaced by colima
brew "docker-compose" # multi-container orchestration
brew "libyaml" # yaml parsing for ruby gems
brew "mise" # polyglot tool version manager
# rustup installed via official installer (not brew) for proper proxy binaries

# terminal
brew "bat" # better cat with syntax highlighting
brew "btop" # process/system monitor
brew "cloc" # count lines of code
brew "direnv" # per-directory env vars (shell hook needs global install)
brew "eza" # modern ls replacement
brew "fd" # better find
brew "fswatch" # file watcher
brew "fzf" # fuzzy finder
brew "hyperfine" # CLI benchmarking tool
brew "jq" # json processor
brew "ripgrep" # better grep
brew "starship" # better prompt
brew "tldr" # simplified man pages with examples
brew "pandoc" # document converter (markdown to pdf, etc)
cask "basictex" # minimal latex for pandoc pdf output
brew "tree" # directory tree
brew "wget" # download files
brew "yt-dlp" # download audio/video for music practice
brew "hledger" # plain text accounting
brew "zoxide" # better cd
cask "ghostty" # terminal emulator

# git
brew "gh" # GitHub CLI
brew "ghq" # git repo manager
brew "git"
brew "git-delta" # syntax-highlighted diffs
brew "git-filter-repo" # rewrite git history
brew "lazygit" # git tui
cask "github" # github desktop

# editor
brew "lua-language-server" # lsp for lua/neovim configs
brew "luarocks" # lua packages for neovim plugins
brew "neovim"
brew "tree-sitter" # syntax parsing for neovim
brew "tree-sitter-cli"

# yazi (file manager + preview deps)
brew "ffmpeg" # video preview
brew "imagemagick" # image preview
brew "poppler" # pdf preview
brew "sevenzip" # archive preview
brew "yazi" # terminal file manager

# fonts (nerd fonts include icons for terminal)
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ibm-plex-sans"
cask "font-meslo-lg-nerd-font"

# rust
brew "bacon" # background rust checker
# brew "bacon-ls" # not ready yet

# swift (tooling managed by aqua in project repos)
brew "xcode-build-server" # lsp for xcode projects
cask "sf-symbols" # browse apple sf symbols

# web
brew "deno"
brew "node@24" # needed for claude

# java / android
brew "gradle"
brew "openjdk"
cask "android-studio"

# c#/.net
cask "dotnet-sdk"

# database
cask "pgadmin4"

# cloud
cask "google-cloud-sdk" # gcloud CLI

# api
cask "ngrok" # expose localhost publicly
cask "postman"

# ai
brew "anomalyco/tap/opencode"
cask "codex"
brew "gemini-cli"
cask "claude"
cask "superwhisper" # voice dictation for ai prompts

# editors
cask "antigravity" # google's ai code editor
cask "visual-studio-code"
cask "zed"

# macos
brew "mas" # Mac App Store CLI
cask "nikitabobko/tap/aerospace" # window manager
mas "Kindle", id: 302584613
mas "Day One", id: 1055511498
mas "Todoist", id: 585829637
mas "Keymapp", id: 6472865291
mas "Apple Developer", id: 640199958

# collaboration
cask "discord"
cask "google-chrome"
cask "slack"

# utilities
cask "anki" # flashcards
cask "balenaetcher" # usb flashing
cask "obs" # screen recording & streaming

# people
cask "hedge-ops/homebrew-tap/people-work"
