{
  "_comment": "Development CLI tools via Scoop. System packages in winget.json.",
  "buckets": [
    { "Name": "main" },
    { "Name": "extras" },
    { "Name": "nerd-fonts" },
    { "Name": "versions" },
    { "Name": "java" }
  ],
  "apps": [
    { "Name": "aqua", "Source": "main", "_comment": "peoplework: per-project CLI tool manager" },
    { "Name": "just", "Source": "main", "_comment": "peoplework: task runner" },
    { "Name": "mise", "Source": "main", "_comment": "peoplework: polyglot version manager (ruby)" },

    { "Name": "bat", "Source": "main", "_comment": "terminal: better cat with syntax highlighting" },
    { "Name": "cloc", "Source": "main", "_comment": "terminal: count lines of code" },
    { "Name": "direnv", "Source": "main", "_comment": "terminal: per-directory env vars" },
    { "Name": "eza", "Source": "main", "_comment": "terminal: modern ls replacement" },
    { "Name": "fd", "Source": "main", "_comment": "terminal: better find" },
    { "Name": "fzf", "Source": "main", "_comment": "terminal: fuzzy finder" },
    { "Name": "hyperfine", "Source": "main", "_comment": "terminal: CLI benchmarking tool" },
    { "Name": "jq", "Source": "main", "_comment": "terminal: json processor" },
    { "Name": "ripgrep", "Source": "main", "_comment": "terminal: better grep" },
    { "Name": "starship", "Source": "main", "_comment": "terminal: cross-shell prompt" },
    { "Name": "tldr", "Source": "main", "_comment": "terminal: simplified man pages" },
    { "Name": "pandoc", "Source": "main", "_comment": "terminal: document converter" },
    { "Name": "wget", "Source": "main", "_comment": "terminal: download files" },
    { "Name": "zoxide", "Source": "main", "_comment": "terminal: better cd" },

    { "Name": "gh", "Source": "main", "_comment": "git: GitHub CLI" },
    { "Name": "ghq", "Source": "main", "_comment": "git: repo manager" },
    { "Name": "delta", "Source": "main", "_comment": "git: syntax-highlighted diffs" },
    { "Name": "git-filter-repo", "Source": "main", "_comment": "git: rewrite history" },
    { "Name": "lazygit", "Source": "extras", "_comment": "git: TUI" },
    { "Name": "github", "Source": "extras", "_comment": "git: GitHub Desktop" },

    { "Name": "lua-language-server", "Source": "main", "_comment": "editor: LSP for lua/neovim configs" },
    { "Name": "luarocks", "Source": "main", "_comment": "editor: lua packages for neovim plugins" },
    { "Name": "neovim", "Source": "main", "_comment": "editor: primary editor" },
    { "Name": "tree-sitter", "Source": "main", "_comment": "editor: syntax parsing for neovim" },

    { "Name": "ffmpeg", "Source": "main", "_comment": "yazi: video preview" },
    { "Name": "imagemagick", "Source": "main", "_comment": "yazi: image preview" },
    { "Name": "poppler", "Source": "main", "_comment": "yazi: pdf preview" },
    { "Name": "7zip", "Source": "main", "_comment": "yazi: archive preview" },
    { "Name": "yazi", "Source": "main", "_comment": "yazi: terminal file manager" },

    { "Name": "IBM-Plex-Sans", "Source": "nerd-fonts", "_comment": "fonts: IBM Plex Sans typeface" },
    { "Name": "FiraCode-NF", "Source": "nerd-fonts", "_comment": "fonts: nerd font with icons" },
    { "Name": "JetBrainsMono-NF", "Source": "nerd-fonts", "_comment": "fonts: nerd font with icons" },
    { "Name": "Meslo-NF", "Source": "nerd-fonts", "_comment": "fonts: nerd font with icons" },

    { "Name": "deno", "Source": "main", "_comment": "languages: deno runtime" },
    { "Name": "nodejs", "Source": "main", "_comment": "languages: needed for claude" },
    { "Name": "gradle", "Source": "main", "_comment": "languages: Java build tool" },
    { "Name": "openjdk", "Source": "java", "_comment": "languages: Java runtime" },
    { "Name": "android-studio", "Source": "extras", "_comment": "languages: Android/Kotlin development" },
    { "Name": "dotnet-sdk", "Source": "main", "_comment": "languages: C#/WinUI development" },

    { "Name": "gcloud", "Source": "extras", "_comment": "cloud: Google Cloud SDK" },

    { "Name": "ngrok", "Source": "main", "_comment": "api: expose localhost publicly" },
    { "Name": "postman", "Source": "extras", "_comment": "api: API testing" },

    { "Name": "opencode", "Source": "main", "_comment": "ai: terminal AI coding agent" },

    { "Name": "vscode", "Source": "extras", "_comment": "editors-backup: Visual Studio Code" },
    { "Name": "zed", "Source": "extras", "_comment": "editors-backup: Zed editor" },

    { "Name": "discord", "Source": "extras", "_comment": "collaboration" },
    { "Name": "googlechrome", "Source": "extras", "_comment": "collaboration: browser" },
    { "Name": "slack", "Source": "extras", "_comment": "collaboration" },

    { "Name": "anki", "Source": "extras", "_comment": "utilities: flashcards" },
    { "Name": "obs-studio", "Source": "extras", "_comment": "utilities: screen recording & streaming" }
  ]
}
