{
  "buckets": [
    { "Name": "main" },
    { "Name": "extras" },
    { "Name": "nerd-fonts" },
    { "Name": "versions" }
  ],
  "apps": [
    { "Name": "aqua", "Source": "main" },
    { "Name": "mise", "Source": "main" },
    { "Name": "rustup", "Source": "main" },

    { "Name": "bat", "Source": "main" },
    { "Name": "btop", "Source": "extras" },
    { "Name": "cloc", "Source": "main" },
    { "Name": "direnv", "Source": "main" },
    { "Name": "eza", "Source": "main" },
    { "Name": "fd", "Source": "main" },
    { "Name": "fzf", "Source": "main" },
    { "Name": "hyperfine", "Source": "main" },
    { "Name": "jq", "Source": "main" },
    { "Name": "ripgrep", "Source": "main" },
    { "Name": "starship", "Source": "main" },
    { "Name": "tldr", "Source": "main" },
    { "Name": "pandoc", "Source": "main" },
    { "Name": "tree", "Source": "main" },
    { "Name": "wget", "Source": "main" },
    { "Name": "zoxide", "Source": "main" },
    { "Name": "ghostty", "Source": "extras" },

    { "Name": "gh", "Source": "main" },
    { "Name": "git", "Source": "main" },
    { "Name": "delta", "Source": "main" },
    { "Name": "git-filter-repo", "Source": "main" },
    { "Name": "lazygit", "Source": "extras" },
    { "Name": "github", "Source": "extras" },

    { "Name": "lua-language-server", "Source": "main" },
    { "Name": "luarocks", "Source": "main" },
    { "Name": "neovim", "Source": "main" },
    { "Name": "tree-sitter", "Source": "main" },

    { "Name": "ffmpeg", "Source": "main" },
    { "Name": "imagemagick", "Source": "main" },
    { "Name": "poppler", "Source": "main" },
    { "Name": "7zip", "Source": "main" },
    { "Name": "yazi", "Source": "main" },

    { "Name": "FiraCode-NF", "Source": "nerd-fonts" },
    { "Name": "JetBrainsMono-NF", "Source": "nerd-fonts" },
    { "Name": "Meslo-NF", "Source": "nerd-fonts" },

    { "Name": "bacon", "Source": "main" },

    { "Name": "nodejs", "Source": "main" },
    { "Name": "openjdk", "Source": "main" },
    { "Name": "dotnet-sdk", "Source": "main" },

    { "Name": "pgadmin4", "Source": "extras" },
    { "Name": "ngrok", "Source": "main" },
    { "Name": "postman", "Source": "extras" },

    { "Name": "claude", "Source": "extras" },
    { "Name": "vscode", "Source": "extras" },
    { "Name": "zed", "Source": "extras" },

    { "Name": "deskflow", "Source": "extras" },

    { "Name": "discord", "Source": "extras" },
    { "Name": "googlechrome", "Source": "extras" },
    { "Name": "slack", "Source": "extras" },

    { "Name": "anki", "Source": "extras" },
    { "Name": "balenaetcher", "Source": "extras" }
  ]
}
